docs/posts/2016-12-28-walls.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Walls</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Walls</h1>
<p class="subtitle" role="doc-subtitle">Dec 28, 2016</p>
</header><p>
In light of the recent political discussion concerning building walls, here is a devotional that I wrote in 2009 when the church assisted on a Habitat for Humanity project.
</p>

<p>
I&rsquo;m usually in favor of building walls, but not when it just becomes another way to burn bridges.
</p>
<section id="outline-container-org22aab30" class="outline-2">
<h2 id="org22aab30">Prayer</h2>
<div class="outline-text-2" id="text-org22aab30">
<p>
Almighty God, 
</p>

<p>
I give thanks for those who are here today to help build this house, for those who have already worked to bring us to this point, and for those who will be here in the future. May you watch over all that happens here, filling us all with the joy of doing your work.
</p>

<p>
We pray also that your blessings will fill this house and those who will live here. May the sounds of laughter echo from these walls, and may love fill these rooms.
</p>

<p>
<i>Amen</i>
</p>
</div>
</section>
<section id="outline-container-org3864080" class="outline-2">
<h2 id="org3864080">Devotional</h2>
<div class="outline-text-2" id="text-org3864080">
<p>
Even though the ones that we see here are far from finished, we should never underestimate the importance of building walls. Nehemiah left the court of the Persian king to rebuild the walls of Jerusalem. For the people of Jerusalem, walls represented safety, security, and an opportunity to be the people of God free from oppression by the enemies that surrounded them.
</p>

<p>
Not all walls are good, though. I&rsquo;m speaking of the walls that we build that separate communities, that keep us apart, those invisible walls that we erect to protect our own comfort zones. In some ways, these are the walls that we cherish the most, but it is these walls that God wants torn down. As Paul says in 1 Corinthians 1:10, &ldquo;Now I appeal to you, brothers and sisters,​ by the name of our Lord Jesus Christ, that all of you be in agreement and that there be no divisions among you, but that you be united in the same mind and the same purpose.&rdquo;
</p>

<p>
We come here from different backgrounds, different families, and different churches. This is an opportunity to build some very important walls, but also maybe to tear down a few walls. May what we do here express that great truth of the Gospel expressed in Galatians 3:28, &ldquo;There is no longer Jew or Greek, there is no longer slave or free, there is no longer male and female; for all of you are one in Christ Jesus.&rdquo;
</p>

<p>
So go now, building those walls that need to go up, and tearing down those walls that need to come down. 
</p>

<p>
In the name of Jesus, 
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org06f6801">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</div>
</section>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
